<template>
    <div>
        <nav-bar show-back="true" title="帮助与反馈"></nav-bar>
        <div class="section">
            <scroller show-scrollbar="false">
                <div class="feedback-content">
                    <text class="title">{{contentTxt[type].title}}</text>
                    <text class="content-txt">{{contentTxt[type].content}}</text>
                </div>
            </scroller>
        </div>

    </div>
</template>

<script>
import NavBar from './components/nav-bar.vue'

export default {
  components: {NavBar},
  data() {
    return {
      type: 1,
      contentTxt: {
        1: {
          title: '关于取消课程与变更策略：',
          content: '用户（学员）在课程开始前 7 个工作日（含 7 个工作日）以上提出正式取消申请（通过APP或微信小程序），我们将提供全额退款。在培训开始前 7 个工作日内提出退课申请，退款额为总金额的 50%。如果您在没有事先通知的情况下，未能前来参加课程，我们将无法为您退款。如果由于智荟平台的原因导致课程无法如期举行，我们将会提供全额退款。\n' +
            '用户（学员）在课程开始前可以与课程提供方联系并将学习名额转予他人学习。\n' +
            '\n' +
            '线上课程的取消与退款\n' +
            '用户向课程发布者支付课程费用后，如课程提供方发布的课程不存在违反法律法规及智荟相关规定，用户在报名成功后，均不得申请退款；\n' +
            '用户向课程发布者支付课程费用后，如课程提供方发布的课程存在违反法律法规及智荟相关规定而发生退费的，则用户同意按如下规则退费：\n' +
            '（1）如果用户购买的是录播课程或含有录播课程，由于用户可以在线回看或下载观看，因此，录播课程不予退费；\n' +
            '（2）如果用户购买的是直播课程，且购买当时已经开课，由于用户可以观看已经开课课程的回放内容，因此，可以回放的课程视为用户已经学习的课程而不予退费，即，用户可以要求退费的比例为尚未开课的课程除以课程发布者发布的所有课程；\n' +
            '（3）用户与课程提供方之间可以就款项支付、退款等任何事项，自行协商解决，用户无权向智荟主张任何权利或要求智荟承担任何责任。\n' +
            '如果用户（学员）认为当天课程质量不合格，应该在当天相应课程完成后两天内提出异议并提供相应证据，逾期提出异议视为课程合格，用户（学员）不得要求退款。 \n' +
            '    用户（学员）不能将线上课程的学习名额转予他人学习。\n'
        },
        2: {
          title: '关于评分/评价的说明',
          content: '用户（学员）购买讲师（课程发布者）的课程并完成学习之后，可以通过智荟APP或智荟小程序对课程进行评价。用户（学员）所发表的评分/评价须有合理的原因与解释，用户（学员）的评分评价仅限于课程内容与教学，不得发表无关评论。智荟平台有权删除违法国家法律法规以及其他违反社会政治常识理论或其他不当言论的评价。\n'
        },
        3: {
          title: '关于纠纷解决机制',
          content: '用户（学员）因使用智荟平台查询、报名、购买、使用讲师（课程发布者）提供的课程发生纠纷时，由于相应课程均由讲师（课程发布者）单独提供，智荟不会也无法参与其中，因此，用户应当与课程发布者协商、诉讼解决，并独立承担相应的风险或责任，与智荟平台无关。如果由于智荟平台过错造成的，智荟平台会依法承担相应责任。\n' +
            '\n' +
            '讲师（课程发布者）拥有课程版权，私自录像或未经版权所有者同意擅自传播属于侵权行为；发生版权纠纷的，课程发布者应当与侵权者协商、诉讼解决，侵权者应该依法承担相应的责任；智荟平台有权协助课程发布者终止侵权者使用课程及其他智荟平台提供的服务。'
        },
        4: {
          title: '关于讲师代开发票政策',
          content: '如用户（学员）提出申请开具税务发票，智荟平台默认用户（学员）的发票申请由智荟平台统一代为课程发布者（讲师）开具。服务费率为发票订单金额的6%（不含发票邮寄费用）。智荟平台代为开具的发票种类为增值税专用发票和增值税普通发票。\n' +
            '\n' +
            '课程发布者（讲师）可以自行为用户（学员）开具正式税务发票，请与智荟客服人员确认后开通此功能。\n' +
            '\n' +
            '如您对代开发票政策有疑问，请致电或发送邮件给智荟客服人员。\n'
        },
        5: {
          title: '关于余额提现的说明',
          content: '课程发布者（讲师）可随时要求提取账户余额斌共提供相应的银行账户信息。智荟平台将于收到提现申请后5个工作日内完成汇款。如您提供的是海外银行账户，则智荟平台将于收到提现申请后15个工作日内完成汇款。\n' +
            '\n' +
            '课程发布者（讲师）如申请提现的金额小于人民币10000元，则每笔提现收取10元的汇款手续费。\n' +
            '课程发布者（讲师）如申请提现的金额为人民币10000元（含）以上，则智荟平台不收取任何汇款手续费。\n' +
            '\n' +
            '如课程发布者（讲师）提供的是海外银行账户，则需自行承担海外银行汇款费用及电报费与其他相关费用。\n' +
            '\n' +
            '如有用户（学员）提出申请税务发票，则实际汇款的金额将扣除相应的6%的税务发票服务费用。\n' +
            '\n' +
            '如您对余额提现政策有疑问，请致电和发送邮件给智荟客服人员。\n'
        }
      }
    }
  }
}
</script>

<style scoped>
    .section {
        width: 710px;
        height: 1100px;
        margin-top: 20px;
        margin-left: 20px;
        margin-bottom: 20px;
        box-shadow: 0px 0px 20px 0px rgba(26, 53, 140, 0.15);
        background-color: #fff;
    }

    .title {
        font-size: 28px;
        color: #0f3691;
    }

    .feedback-content {
        display: flex;
        flex-direction: column;
        width: 710px;
        height: 1100px;
        margin-bottom: 40px;
        align-items: center;
        justify-content: flex-start;
        margin-top: 30px;
        padding-left: 20px;
    }

    .content-txt {
        margin-top: 40px;
        font-size: 24px;
        color: #646464;
        word-break: break-all;
        word-wrap: break-word;
        width: 690px;
        height: 1100px;
    }
</style>
